#Комплексные числа
complexNumber=1+2j
print(complexNumber)


''' Управляющие последовательности в строке

# Строка может содержать ряд специальных символов - управляющих последовательностей. 

# Некоторые из них:

# \\: позволяет добавить внутрь строки слеш

# \': позволяет добавить внутрь строки одинарную кавычку

# \": позволяет добавить внутрь строки двойную кавычку

# \n: осуществляет переход на новую строку

# \t: добавляет табуляцию (4 отступа)

# '''

text='Сообщение:\n\'Hello my friends\''
print(text)
textq='Сообщение:\t\'Hello my friends\''
print(textq)

#print('gg', end= ' ')
#print('wp')

#Операторы в программировании

# 1. Арифметические операторы
# + - / *
# // - целочисленное деление
# % - деление с остатком
# ** - возведение в степень
print(4+5)
print(4-5)
print(6*8)
print(12/5)
print(12//5)
print(25%3)
print(2**2)

#Операции направления
# ** - справа налево
# + - * / // % - слева направо

number=3+4*5**2+7
# 1 шаг
# 5**2=25
# 2 шаг
# 25*4=100
# 3 шаг
#100+3=103
# 4 шаг
# 103+7=110
print(number)

number=(3+4)*(5**2+7)
print(number)

# Арифметические операции с присвоением
# +=
# -+
# /=
# *=
# //=
# %=
# **=

number=10
number+=5
number-=5
number/=5

#Округление round
first_num=2.0001
sec_num=5
third_num=first_num/sec_num
print(third_num)
print(round(2.001+0.1))
print(round(2.001+0.1,2))

print(round(4.6759940+9.77993,3))


